In [1]:
import numpy as np
import pandas as pd

In [3]:
data=pd.Series([0,1,2,3,4,5,np.nan,6,7,8])

In [4]:
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    NaN
7    6.0
8    7.0
9    8.0
dtype: float64

In [5]:
data.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [6]:
data.notnull()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
dtype: bool

In [7]:
dict1={0:[1,4,7,np.nan],1:[2,5,np.nan,np.nan],3:[3,np.nan,np.nan,np.nan],4:[np.nan,np.nan,np.nan,np.nan]}
df=pd.DataFrame(dict1)
df

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [8]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 3, 4]
Index: []

In [9]:
df.dropna(how="all)

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [10]:
df.dropna(axis=1,how="all")

     0    1    3
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [11]:
df

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [12]:
df.dropna(thresh=1)

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [13]:
df.dropna(thresh=1,axis=1)

     0    1    3
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [14]:
df

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [16]:
df_fill=df.fillna(10)

In [17]:
df_fill

      0     1     3     4
0   1.0   2.0   3.0  10.0
1   4.0   5.0  10.0  10.0
2   7.0  10.0  10.0  10.0
3  10.0  10.0  10.0  10.0

In [22]:
df.fillna({0:10,1:20,3:30,4:40})

      0     1     3     4
0   1.0   2.0   3.0  40.0
1   4.0   5.0  30.0  40.0
2   7.0  20.0  30.0  40.0
3  10.0  20.0  30.0  40.0

      0     1     3     4
0   1.0   2.0   3.0  10.0
1   4.0   5.0  10.0  10.0
2   7.0  10.0  10.0  10.0
3  10.0  10.0  10.0  10.0

In [21]:
df.fillna(method="ffill")

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  3.0 NaN

In [24]:
df.fillna(method="ffill",limit=3)

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  3.0 NaN

In [25]:
df.fillna(axis=1,method="ffill",limit=1)

     0    1    3    4
0  1.0  2.0  3.0  3.0
1  4.0  5.0  5.0  NaN
2  7.0  7.0  NaN  NaN
3  NaN  NaN  NaN  NaN

In [26]:
df.mean()

0    4.0
1    3.5
3    3.0
4    NaN
dtype: float64

In [27]:
df.fillna(df.mean())

     0    1    3   4
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  3.5  3.0 NaN
3  4.0  3.5  3.0 NaN

In [28]:
ser1=pd.Series([1,2,3,4,5,100,7,8,9])

In [29]:
ser1

0      1
1      2
2      3
3      4
4      5
5    100
6      7
7      8
8      9
dtype: int64

In [30]:
ser1.replace(100,6)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [31]:
ser1.replace([100,6,7],50)

0     1
1     2
2     3
3     4
4     5
5    50
6    50
7     8
8     9
dtype: int64

In [32]:
ser1.replace({100:np.nan,1:50})

0    50.0
1     2.0
2     3.0
3     4.0
4     5.0
5     NaN
6     7.0
7     8.0
8     9.0
dtype: float64

In [33]:
ser2=pd.Series(list("abcdeabcd"))

In [34]:
ser2

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
dtype: object

In [36]:
pd.get_dummies(ser2)

   a  b  c  d  e
0  1  0  0  0  0
1  0  1  0  0  0
2  0  0  1  0  0
3  0  0  0  1  0
4  0  0  0  0  1
5  1  0  0  0  0
6  0  1  0  0  0
7  0  0  1  0  0
8  0  0  0  1  0